Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_guide_to_redundancy_procedures.html.txt.tmx
Source language: en
Languages: ga

source: Checklist guide to redundancy procedures
ga: Seicliosta: Treoir ar nósanna imeachta iomarcaíochta

source: It is important to be aware of your options and entitlements in a redundancy situation
ga: Do chuid roghanna i gcás iomarcaíochta

source: │Redundancy │Entitlement and points to check │
ga: │Nós imeachta │Teidlíocht agus pointí le seiceáil │

source: │Notice of │At least 2 weeks' notice giving date of termination of employment │
ga: │Fógra │Ar a laghad fógra de dhá sheachtain ag tabhairt dáta críochnaithe na │

source: │Qualifying │At least 2 years' continuous service with employer, see more about who qualifies for│
ga: │Ag cáiliú │Ar a laghad dhá bhliain de sheirbhís leanúnach leis an bhfostóir, féach breis │

source: │for │redundancy here │ │redundancy │ │
ga: │d'iomarcaíocht │faisnéise faoi cé acháilíonn d'iomarcaíocht anseo │

source: │Offer of │It should be a reasonable offer
ga: │Tairiscint │Ba chóir gur tairiscint réasúnta a bheadh ann

source: (Note: if you refuse a reasonable offer you may │
ga: (Nóta: má dhiúltaíonn tú │

source: │alternative │lose your entitlement to redundancy payment) │
ga: │d'obair │tairiscint réasúnta d'fhéadfá do theidlíocht ar íocaíocht iomarcaíochta a │

source: │Lay off or │If in a lay-off or short-time situation you may claim redundancy payment on form RP9│
ga: │Asleagan nó │Más i gcás asleagain nó gearr-ama atá tú, d'fhéadfá íocaíocht iomarcaíochta a │

source: │short time │(pdf). │
ga: │gearr-am │éileamh ar fhoirm RP9 (pdf) │

source: │Number of │Whether all or just some of the employees │
ga: │Líon na │Cé acu na fostaithe ar fad nó díreach cuid acu │

source: │ │If you are unfairly selected for redundancy, or if you think that a genuine │
ga: │ │Má roghnaítear go héagórach tú chun iomarcaíochta d'fhéadfá éileamh a dhéanamh │

source: │Selection │redundancy does not exist, you may be able to claim unfair dismissal
ga: │Roghnú chun │ar dhífhostú éagórach

source: (However, if │ │for │your employer decides that your work will be done in a different way and you are not│
ga: (Áfach, má chinneann d'fhostóir go mbeidh do chuid oibre│

source: │redundancy │trained or qualified to do the work in that way, this would be a genuine redundancy │
ga: │iomarcaíochta │déanta de réir modha éagsúil agus mura mbíonn tú cáilithe chun an modh oibre │

source: │collective │Information should be provided by employer at least 30 days before dismissal
ga: │Más │Ba chóir don fhostóir faisnéis a sholáthar ar a laghad 30 lá roimh dhífhostú

source: │Redundancy │Just the statutory entitlement or can more be negotiated with employer?
ga: │Íocaíocht │An teidlíocht reachtúil amháin nó an féidir níos mó a chomhaontú leis an │

source: │statutory │You can use the worksheet Calculating your redundancy payment here or the online │
ga: │Méid an phá │Is féidir leat an bhileog oibre Ag ríomh d'íocaíocht iomarcaíochta anseo a │

source: │redundancy │redundancy calculator │
ga: │iomarcaíochta │úsáid nó áireamhán iomarcaíochta ar líne │

source: │look for │During last 2 weeks before termination of employment │
ga: │Am saor chun │Le linn an dá sheachtain deiridh roimh chríochnú na fostaíochta │

source: │before the │ │
ga: │Ag fágáil roimh │ │

source: │termination │Give your employer a completed Form RP6 (pdf)
ga: │chríochnú na │Tabhair foirm chomhlánaithe RP6 (pdf) go dtí d'fhostóir

source: │termination │Employer gives you your lump-sum redundancy payment
ga: │críochnaithe na │Tugann an fostóir d'íocaíocht iomarcaíochta mar chnapshuim

source: │No │You should apply to your employer for it
ga: │íocaíocht │iarratas ar d'fhostóir a dhéanamh

source: If your employer still refuses to pay it, │
ga: Má dhiúltaíonn d'fhostóir don íocaíocht fós,│

source: │redundancy │you can apply to the Department of Social Protection for direct payment from the │
ga: │iomarcaíochta │is féidir leat iarratas a dhéanamh ar íocaíocht díreach ón gCiste Árachais │

source: │payment │Social Insurance Fund
ga: │tugtha │Sóisialaigh sa Roinn Coimirce Sóisialaí

source: │Dispute │Within 12 months make claim to the Workplace Relations Commission using the online │
ga: │Aighneas faoi │Laistigh de 12 mhí déan éileamh ar an gCoimisiún um Chaidreamh san Áit Oibre │

source: │about │complaint form available on workplacerelations.ie
ga: │iomarcaíocht │tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie)

source: │More │Read about redundancy procedures here or contact the Workplace Relations Commission │
ga: │Breis faisnéise │Léigh faoi nósanna imeachta iomarcaíochta nó déan teagmháil leis an tSeirbhís │

source: │information │Information and Customer Service
ga: │ar fáil │Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre
